<template>
  <div class="main">
    <component
      :is="item.src ? 'CardPic' : 'CardText'"
      class="card"
      v-for="(item, index) in list"
      :key="index"
      :data="item"
    ></component>
    <!-- <card-text></card-text>
    <card-pic></card-pic> -->
  </div>
</template>

<script>
export default {
  name: 'Main',
  data() {
    return {
      list: [
        {
          title: '我才不会写年终总结之瞎说篇',
          date: '2017-12-30',
          view: 1235,
          src: '',
          content: `确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自所以正经八儿的事情略了
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受也得接受，老板一句“这是命令...`,
          time: '31 Comments',
        },
        {
          title: '我才不会写年终总结之瞎说篇',
          date: '2017-12-30',
          view: 1235,
          src: require('@/assets/cardPic.jpg'),
          content: `确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自所以正经八儿的事情略了
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受也得接受，老板一句“这是命令...`,
          time: '31 Comments',
        },
        {
          title: '我才不会写年终总结之瞎说篇',
          date: '2017-12-30',
          view: 1235,
          src: require('@/assets/cardPic.jpg'),
          content: `确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自所以正经八儿的事情略了
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受也得接受，老板一句“这是命令...`,
          time: '31 Comments',
        },
        {
          title: '我才不会写年终总结之瞎说篇',
          date: '2017-12-30',
          view: 1235,
          src: '',
          content: `确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        确实讨厌去写所谓的年终总结，在公司已经被动的想领导上交一个总结，自所以正经八儿的事情略了
        己就懒得去总结，不然，我觉得脑子里应该会编写出八九不离十的内容，所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受所以正经八儿的事情略了
        ，瞎说一下。 年初的人事调动是个人最不能接受的事情，但不接受也得接受，老板一句“这是命令...`,
          time: '31 Comments',
        },
      ],
    }
  },
}
</script>

<style lang="scss" scoped>
.main {
  background: #fff;
  position: relative;
  padding: 60px 0 20px;
  border-top: 1px solid #ccc;
  display: flex;
  flex-direction: column;
  justify-content: center;
  align-items: center;
  .card {
    margin-bottom: 100px;
  }
}
</style>
